; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v4 ?v12)
             (pred_8 ?v11 ?v10)
             (pred_4 ?v4 ?v10)
             (pred_1 ?v6 ?v4 )
	     (pred_5 ?v4)
             (pred_9 ?v1)
             (pred_10 ?v11)
             (pred_12 ?v10)
             (pred_6 ?v4)
             (pred_7 ?v11)
             (pred_2 ?v4)
             (pred_3 ))



(:action op_2
:parameters (?v5 ?v2 ?v8 ?v3)
:precondition (and (pred_9 ?v5) (pred_9 ?v2) (pred_10 ?v8) (pred_12 ?v3)
          (pred_11 ?v5 ?v2) (pred_8 ?v8 ?v3)
                   (pred_4 ?v2 ?v3) (pred_5 ?v5) 
                   (pred_6 ?v2) (pred_7 ?v8))
:effect (and  (pred_2 ?v2) (not (pred_6 ?v2))))


(:action op_4
:parameters (?v5 ?v7)
:precondition (and (pred_9 ?v5) (pred_9 ?v7)
               (pred_5 ?v5) (pred_11 ?v5 ?v7) (pred_2 ?v7))
:effect (and (pred_5 ?v7) (not (pred_5 ?v5))))

(:action op_3
:parameters (?v5 ?v8)
:precondition (and (pred_9 ?v5) (pred_10 ?v8) 
                  (pred_5 ?v5) (pred_1 ?v8 ?v5) (pred_3 ))
:effect (and (pred_7 ?v8)
   (not (pred_1 ?v8 ?v5)) (not (pred_3 ))))


(:action op_1
:parameters (?v5 ?v9 ?v13)
:precondition (and (pred_9 ?v5) (pred_10 ?v9) (pred_10 ?v13)
                  (pred_5 ?v5) (pred_7 ?v13) (pred_1 ?v9 ?v5))
:effect (and (pred_7 ?v9) (pred_1 ?v13 ?v5)
        (not (pred_7 ?v13)) (not (pred_1 ?v9 ?v5))))

(:action op_5
:parameters (?v5 ?v8)
:precondition (and (pred_9 ?v5) (pred_10 ?v8) 
                  (pred_5 ?v5) (pred_7 ?v8))
:effect (and (pred_3 ) (pred_1 ?v8 ?v5) (not (pred_7 ?v8)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_17 obj_09 obj_24 obj_04 obj_25 obj_26 obj_23 obj_20 obj_02 obj_22 obj_29 obj_21 obj_28 obj_06 obj_15 obj_18 obj_13 obj_19 obj_10 obj_14 obj_16 obj_30 obj_01 obj_08 obj_03
    obj_05 obj_07
    obj_12 obj_11 obj_27
    )

    (:init
       (pred_3)

       (pred_9 obj_17)
       (pred_9 obj_09)
       (pred_9 obj_24)
       (pred_9 obj_04)
       (pred_9 obj_25)
       (pred_9 obj_26)
       (pred_9 obj_23)
       (pred_9 obj_20)
       (pred_9 obj_02)
       (pred_9 obj_22)
       (pred_9 obj_29)
       (pred_9 obj_21)
       (pred_9 obj_28)
       (pred_9 obj_06)
       (pred_9 obj_15)
       (pred_9 obj_18)
       (pred_9 obj_13)
       (pred_9 obj_19)
       (pred_9 obj_10)
       (pred_9 obj_14)
       (pred_9 obj_16)
       (pred_9 obj_30)
       (pred_9 obj_01)
       (pred_9 obj_08)
       (pred_9 obj_03)
       (pred_12 obj_05)
       (pred_12 obj_07)
       (pred_10 obj_12)
       (pred_10 obj_11)
       (pred_10 obj_27)

       (pred_11 obj_17 obj_26)
       (pred_11 obj_17 obj_09)
       (pred_11 obj_09 obj_23)
       (pred_11 obj_09 obj_24)
       (pred_11 obj_09 obj_17)
       (pred_11 obj_24 obj_20)
       (pred_11 obj_24 obj_04)
       (pred_11 obj_24 obj_09)
       (pred_11 obj_04 obj_02)
       (pred_11 obj_04 obj_25)
       (pred_11 obj_04 obj_24)
       (pred_11 obj_25 obj_22)
       (pred_11 obj_25 obj_04)
       (pred_11 obj_26 obj_29)
       (pred_11 obj_26 obj_23)
       (pred_11 obj_26 obj_17)
       (pred_11 obj_23 obj_21)
       (pred_11 obj_23 obj_20)
       (pred_11 obj_23 obj_09)
       (pred_11 obj_23 obj_26)
       (pred_11 obj_20 obj_28)
       (pred_11 obj_20 obj_02)
       (pred_11 obj_20 obj_24)
       (pred_11 obj_20 obj_23)
       (pred_11 obj_02 obj_06)
       (pred_11 obj_02 obj_22)
       (pred_11 obj_02 obj_04)
       (pred_11 obj_02 obj_20)
       (pred_11 obj_22 obj_15)
       (pred_11 obj_22 obj_25)
       (pred_11 obj_22 obj_02)
       (pred_11 obj_29 obj_18)
       (pred_11 obj_29 obj_21)
       (pred_11 obj_29 obj_26)
       (pred_11 obj_21 obj_13)
       (pred_11 obj_21 obj_28)
       (pred_11 obj_21 obj_23)
       (pred_11 obj_21 obj_29)
       (pred_11 obj_28 obj_19)
       (pred_11 obj_28 obj_06)
       (pred_11 obj_28 obj_20)
       (pred_11 obj_28 obj_21)
       (pred_11 obj_06 obj_10)
       (pred_11 obj_06 obj_15)
       (pred_11 obj_06 obj_02)
       (pred_11 obj_06 obj_28)
       (pred_11 obj_15 obj_14)
       (pred_11 obj_15 obj_22)
       (pred_11 obj_15 obj_06)
       (pred_11 obj_18 obj_16)
       (pred_11 obj_18 obj_13)
       (pred_11 obj_18 obj_29)
       (pred_11 obj_13 obj_30)
       (pred_11 obj_13 obj_19)
       (pred_11 obj_13 obj_21)
       (pred_11 obj_13 obj_18)
       (pred_11 obj_19 obj_01)
       (pred_11 obj_19 obj_10)
       (pred_11 obj_19 obj_28)
       (pred_11 obj_19 obj_13)
       (pred_11 obj_10 obj_08)
       (pred_11 obj_10 obj_14)
       (pred_11 obj_10 obj_06)
       (pred_11 obj_10 obj_19)
       (pred_11 obj_14 obj_03)
       (pred_11 obj_14 obj_15)
       (pred_11 obj_14 obj_10)
       (pred_11 obj_16 obj_30)
       (pred_11 obj_16 obj_18)
       (pred_11 obj_30 obj_01)
       (pred_11 obj_30 obj_13)
       (pred_11 obj_30 obj_16)
       (pred_11 obj_01 obj_08)
       (pred_11 obj_01 obj_19)
       (pred_11 obj_01 obj_30)
       (pred_11 obj_08 obj_03)
       (pred_11 obj_08 obj_10)
       (pred_11 obj_08 obj_01)
       (pred_11 obj_03 obj_14)
       (pred_11 obj_03 obj_08)
       (pred_6 obj_17)
       (pred_6 obj_13)
       (pred_6 obj_16)
       (pred_4  obj_17 obj_05)
       (pred_4  obj_13 obj_07)
       (pred_4  obj_16 obj_07)
       (pred_2 obj_09)
       (pred_2 obj_24)
       (pred_2 obj_04)
       (pred_2 obj_25)
       (pred_2 obj_26)
       (pred_2 obj_23)
       (pred_2 obj_20)
       (pred_2 obj_02)
       (pred_2 obj_22)
       (pred_2 obj_29)
       (pred_2 obj_21)
       (pred_2 obj_28)
       (pred_2 obj_06)
       (pred_2 obj_15)
       (pred_2 obj_18)
       (pred_2 obj_19)
       (pred_2 obj_10)
       (pred_2 obj_14)
       (pred_2 obj_30)
       (pred_2 obj_01)
       (pred_2 obj_08)
       (pred_2 obj_03)

       (pred_8  obj_12 obj_05)
       (pred_8  obj_11 obj_07)
       (pred_8  obj_27 obj_05)
       (pred_1 obj_12 obj_08)
       (pred_1 obj_11 obj_09)
       (pred_1 obj_27 obj_02)
       (pred_5 obj_19)
    )

    (:goal (and
       (pred_1 obj_27 obj_28)
    ))
(:constraints
  (always (not (pred_5 obj_20)))
)
)

; plan
1. (op_4 obj_19 obj_28)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_28)
   goals met: 0 of 1
2. (op_4 obj_28 obj_06)
   deleted: (pred_5 obj_28)
   added: (pred_5 obj_06)
   goals met: 0 of 1
3. (op_4 obj_06 obj_02)
   deleted: (pred_5 obj_06)
   added: (pred_5 obj_02)
   goals met: 0 of 1
4. (op_3 obj_02 obj_27)
   deleted: (pred_1 obj_27 obj_02) (pred_3)
   added: (pred_7 obj_27)
   goals met: 0 of 1
5. (op_4 obj_02 obj_06)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_06)
   goals met: 0 of 1
6. (op_4 obj_06 obj_28)
   deleted: (pred_5 obj_06)
   added: (pred_5 obj_28)
   goals met: 0 of 1
7. (op_5 obj_28 obj_27)
   deleted: (pred_7 obj_27)
   added: (pred_3) (pred_1 obj_27 obj_28)
   goals met: 1 of 1
